{
  "name": "Ksenia Shabelnikov",
  "linkedin": "LinkedIn Profile",
  "cv": "Download CV",
  "call": "Call me",
  "contacts": "Contacts",
  "about_header": "Who am I?",
  "about1": "Originally from Moscow, I relocated to Israel eight years ago with a background in music and a Bachelor’s degree in the field. I have worked as a singer and vocal coach, developing strong communication and creative skills.",
  "about2": "Several years ago, I transitioned to programming, focusing on FrontEnd Development. Now, as I seek my first role in tech, I offer a blend of artistic flair and technical skill, bolstered by disciplined practice.",
  "about3": "I am highly motivated and organized, fluent in Russian, Hebrew, and English, and ready to join a dynamic FrontEnd team.",
  "summary": "Summary",
  "summary_description": "FrontEnd/FullStack Developer with 1+ year of relevant experience, located in Israel. Strong knowledge of JavaScript, TypeScript, React, Redux, CSS and other technologies. I am a highly motivated and well-organized person, hard worker and fast learner. Excellent at both team and individual work",
  "skills": "Professional skills",
  "projects": "My Projects",
  "project_stellar_description": "Using the Yandex Practicum platform’s UI library, I developed a site for selling burgers, from scratch through\ndeployment.\nMy tasks: Layouting according to the design, authentication/authorization logic, sending requests and processing\nresponses using both fetch requests and WebSocket connection. Setting routing, including dynamic routes, and Redux\nstore. Writing tests: Jest and Cypress.",
  "link": "Go to website",
  "link_github": "Go to GitHub",
  "project_tennis_description": "A project for amateur tennis players: every registered user can find a partner to play with, according to their level of play and location. I was fully responsible for the front-end part of the project, including design, adaptive layout, fetch requests to the server, and connecting authorization/authentication using Firebase. I also implemented multilingual functionality. The project is work in progress.",
  "project_shop_description": "In collaboration with other students I am developing an online store for selling furniture. The project involves the full development cycle, both backend and frontend, from scratch under the guidance of experienced developers. My tasks included developing new reusable components from scratch through testing phase according to the agreed design and tasks from the team lead, both layouts (including responsive layout) and business logic; Hebrew/English translations using i18next library; integration with server-side components and APIs using fetch requests; and taking part in meetings to discuss the project logic. The project is work in progress.",
  "project_site_description": "This website — created from scratch based on my own idea, design, adaptive layout and multilingual functionality.",
  "testimonial_header": "Testimonials",
  "testimonial1": "Ksenia is a very talented developer and can be relied upon to deliver your front-end needs.",
  "testimonial2": "I highly recommend Ksenia for any web development position. Her dedication to learning and solid grasp of web development concepts have been evident throughout her time with us. She consistently delivers high-quality work and demonstrates a strong commitment to her craft."
}