{
  "name": "קסניה שבלניקוב",
  "linkedin": "פרופיל לינקדאין",
  "cv": "הורדת קורות חיים",
  "call": "תתקשר אלי",
  "contacts": "צור קשר",
  "about_header": "מי אני?",
  "about1": "במקור ממוסקבה, עליתי לישראל לפני שמונה שנים עם רקע במוזיקה ותואר ראשון בתחום. עבדתי כזמרת ומאמנת קול, ופיתחתי יכולות תקשורת ויצירתיות מעולות.",
  "about2": "לפני מספר שנים עברתי לתחום התכנות, עם דגש על פיתוח חזיתי. כעת, כשאני מחפשת את תפקידי הראשון בתעשייה הטכנולוגית, אני מציעה שילוב של כישרון אמנותי ומיומנות טכנית, שנבנה על בסיס של תרגול מדורג.",
  "about3": " אני מאוד מוטיבציה ומאורגנת, דוברת רוסית, עברית ואנגלית, ומוכנה להצטרף לצוות פיתוח חזיתי דינמי.",
  "summary": "סיכום",
  "summary_description": "מפתח FrontEnd/FullStack עם ניסיון רלוונטי של שנה ומעלה. ידע חזק ב-JavaScript, TypeScript, React, Redux, CSS וטכנולוגיות נוספות. אני אדם בעל מוטיבציה ומאורגן היטב, עובד קשה ולומד מהר. מעולה בעבודה בצוות ובעבודה אישית",
  "skills": "כישורים המקצועים",
  "projects": "הפרויקטים שלי",
  "project_stellar_description": "באמצעות ספריית ה-UI של פלטפורמת Yandex Practicum, פיתחתי אתר למכירת המבורגרים, מאפס ועד\nפְּרִיסָה.\nהמשימות שלי: פריסה לפי העיצוב, לוגיקה של אימות/הרשאה, שליחת בקשות ועיבוד\nתגובות באמצעות בקשות אחזור וחיבור WebSocket. הגדרת ניתוב, כולל מסלולים דינמיים, ו-Redux\nחנות. כתיבת מבחני: ג'סט וברוש.",
  "link": "עבור לאתר",
  "link_github": "עבור אל Github",
  "project_tennis_description": "פרויקט לטניסאי חובבים: כל משתמש רשום יכול למצוא שותף לשחק איתו, לפי רמת המשחק והמיקום שלו. הייתי אחראי באופן מלא על החלק הקדמי של הפרויקט, כולל עיצוב, פריסה אדפטיבית, בקשות אחזור לשרת וחיבור הרשאות/אימות באמצעות Firebase. יישמתי גם פונקציונליות רב לשונית. הפרויקט נמצא בתהליך עבודה.",
  "project_shop_description": "בשיתוף סטודנטים נוספים אני מפתחת חנות מקוונת למכירת רהיטים. הפרויקט כרוך במלואו\nמחזור פיתוח, הן backend והן frontend, מאפס בהדרכת מפתחים מנוסים.\nהמשימות שלי: פיתוח רכיבים חדשים לשימוש חוזר מאפס ועד בדיקה לפי התכנון והמשימות המוסכמות\nמראש הצוות, גם פריסות (כולל פריסה רספונסיבית) וגם היגיון עסקי. מימוש תרגומים ל\nעברית/אנגלית באמצעות ספריית i18next. יצירת אינטגרציה עם רכיבי צד שרת וממשקי API באמצעות בקשות אחזור.\nהשתתפות בפגישות לדיון בהיגיון של הפרויקט. שחזור הקוד הקיים כדי להגיע למהירות מקסימלית ו\nמדרגיות.",
  "project_site_description": "אתר זה - נוצר מאפס בהתבסס על רעיון משלי, עיצוב, פריסה אדפטיבית ופונקציונליות רב לשונית.",
  "testimonial_header": "המלצות",
  "testimonial1": "קסניה היא מפתחת מוכשרת מאוד וניתן לסמוך עליה שתספק את הצרכים הקדמיים שלך.",
  "testimonial2": "אני ממליץ בחום על קסניה לכל תפקיד בפיתוח אתרים. המסירות שלה ללמידה ותפיסה מוצקה במושגי פיתוח אתרים ניכרה לאורך כל תקופתה איתנו. היא מספקת באופן עקבי עבודה באיכות גבוהה ומפגין מחויבות חזקה למלאכתה."
}